alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    /*
    Se añade a la lista de envíos dos dummies para que se puedan comprobar todas las recepciones tras los envíos.
    Si no se hace esto entonces habría que implementar una lógica adicional de traslado de paquetes hacia el inicio de los que se han recibido y 
    comprobarlo más adelante, aciendo que el fallo venga más tarde de lo deseado y pudiendo producir un error indeseado como una configuración mala.
    */
    send_confirmation_values(INTAN_config);
    uint16_t pckt_count = 0;

    while(pckt_count != INTAN_config->max_size){       
            
            // wait_1_second();
            
            OFF_CS_pin();
            __delay_cycles(CLK_5_CYCLES);

            send_values(INTAN_config, pckt_count);
            
            __delay_cycles(CLK_10_CYCLES);
            ON_CS_pin();   
            
            __delay_cycles(CLK_5_CYCLES);

            if(INTAN_config->time_restriction[pckt_count]){
                wait_1_second();
            }
            pckt_count += 1;
        
    }
    pckt_count = 0;
    
    bool checked_rcvd = check_received_commands(INTAN_config);
    if (!checked_rcvd){
        // while(1){
            ON_INTAN_LED();
        // }
    }else{
         OFF_INTAN_LED();
    }
    INTAN_config->max_size = 0;
}


// Funtion used to check if the returned values are correct or not
bool check_received_commands(INTAN_config_struct* INTAN_config){
    uint16_t index;
    // If the value to be compared actually does not mean anything (as if it a read function) return true
    for (index = 0; index < INTAN_config->max_size-1; index++){
        if (INTAN_config->expected_RX_bool[index] == 1) {       
            if (index+2 >= MAX_VALUES){
                // Failure because more than the expected values have been sent and there is an index out of bounds.
                return false;
            }
            if (INTAN_config->obtained_RX[index+2] != INTAN_config->expected_RX[index]){
                INTAN_config->obtained_RX[index+2] = 0;
                INTAN_config->expected_RX[index] = 0;
                return false;
            }
                INTAN_config->obtained_RX[index+2] = 0;
                INTAN_config->expected_RX[index] = 0;
        }
        if (INTAN_config->instruction[index] == 'M'){
            int i;
            for (i = 0; i < 16; i++) {
                // Compare bit a bit if any has a value 1 this one is related to the reading of the register 40 in the compliance monitor
                if (INTAN_config->obtained_RX[index+2] & (1 << i)) {
                    perror("Initialyzing compliance monitor.");
                }
            }
          
        } else if (INTAN_config->instruction[index] == 'f') {
            // Compare bit zero if has a value 1 this one is related to the reading of the register 50 fault current detector
            if (INTAN_config->obtained_RX[0] & (1)) {
                perror("Fault current detection.");
                perror("Rewrite SPI commands or turn off.");
                while(1);
            }

        }


    }

    return true;
}

//Function to check if the INTAN is working at all
void check_intan_SPI_array(INTAN_config_struct* INTAN_config){
    volatile uint16_t reg_config_num = INTAN_config->max_size;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;
}


void clear_command(INTAN_config_struct* INTAN_config){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // uint8_t obtained_RX_i = INTAN_config->obtained_RX_i;
    // Comando de limpieza recomendado en la pg 33 para inicializar el ADC para su operación normal
    INTAN_config->array1[reg_config_num] = CLEAR_ACTION;
    INTAN_config->array2[reg_config_num] = ZEROS_8;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;


    if (INTAN_config->C2_enabled == false){
        INTAN_config->expected_RX[reg_config_num] = ZEROS_32;
    } else{
        INTAN_config->expected_RX[reg_config_num] = RETURN_CLEAR_2C;
    }
    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = 'L';


    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;

}

void write_command(INTAN_config_struct* INTAN_config, uint8_t R, uint16_t D){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // Flag U on M off
    if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == false)){
        INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;

