alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    }else if(freq == 3.0f){
        RL_SEL1 = RL_SEL1_3H;
        RL_SEL2 = RL_SEL2_3H;
        RL_SEL3 = RL_SEL3_3H;
        
    }else if(freq == 2.5f){
        RL_SEL1 = RL_SEL1_2_5H;
        RL_SEL2 = RL_SEL2_2_5H;
        RL_SEL3 = RL_SEL3_2_5H;
        
    }else if(freq == 2.0f){
        RL_SEL1 = RL_SEL1_2H;
        RL_SEL2 = RL_SEL2_2H;
        RL_SEL3 = RL_SEL3_2H;
        
    }else if(freq == 1.5f){
        RL_SEL1 = RL_SEL1_1_5H;
        RL_SEL2 = RL_SEL2_1_5H;
        RL_SEL3 = RL_SEL3_1_5H;
        
    }else if(freq == 1.0f){
        RL_SEL1 = RL_SEL1_1H;
        RL_SEL2 = RL_SEL2_1H;
        RL_SEL3 = RL_SEL3_1H;
        
    }else if(freq == 0.75f){
        RL_SEL1 = RL_SEL1_0_75H;
        RL_SEL2 = RL_SEL2_0_75H;
        RL_SEL3 = RL_SEL3_0_75H;
        
    }else if(freq == 0.5f){
        RL_SEL1 = RL_SEL1_0_5H;
        RL_SEL2 = RL_SEL2_0_5H;
        RL_SEL3 = RL_SEL3_0_5H;
        
    }else if(freq == 0.3f){
        RL_SEL1 = RL_SEL1_0_3H;
        RL_SEL2 = RL_SEL2_0_3H;
        RL_SEL3 = RL_SEL3_0_3H;
        
    }else if(freq == 0.25f){
        RL_SEL1 = RL_SEL1_0_25H;
        RL_SEL2 = RL_SEL2_0_25H;
        RL_SEL3 = RL_SEL3_0_25H;
        
    }else if(freq == 0.1f){
        RL_SEL1 = RL_SEL1_0_1H;
        RL_SEL2 = RL_SEL2_0_1H;
        RL_SEL3 = RL_SEL3_0_1H;
        
    }else{
        perror("Error: high cutoff frequency Kilo.");
    }
    RL = ((uint16_t)RL_SEL3 << 13) |((uint16_t)RL_SEL2 << 7) | RL_SEL1;
    write_command(INTAN_config, (uint8_t)ADC_LOW_FREQ_B, RL);

}


void power_up_AC(INTAN_config_struct* INTAN_config){
    write_command(INTAN_config, ADC_INDIVIDUAL_AMP_POWER, 0xFFFF);
}

void A_or_B_cutoff_frequency(INTAN_config_struct* INTAN_config){
    uint8_t i;
    uint16_t amp_values = 0;
    for (i = NUM_CHANNELS; i > 0; i--){
        if(INTAN_config->amplfier_cutoff_frequency_A_B[i-1] == 'B'){
            amp_values = amp_values | (1<<(i-1));
        }
    }
    write_command(INTAN_config, AMP_LOW_CUTOFF_FREQ_SELECT, amp_values);
    INTAN_config->waiting_trigger = true;
}

void amp_fast_settle(INTAN_config_struct* INTAN_config){
    uint8_t i;
    uint16_t amp_values = 0;
    for (i = NUM_CHANNELS; i > 0; i--){
        if(INTAN_config->amplfier_reset[i-1]){
            amp_values = amp_values | (1<<(i-1));
        }
    }
    uint16_t reg_config_num = INTAN_config->max_size;
    INTAN_config->time_restriction[reg_config_num] = true;
    write_command(INTAN_config, AMPLIFIER_FAST_SETTLE, amp_values);
    INTAN_config->waiting_trigger = true;   
}


void amp_fast_settle_reset(INTAN_config_struct* INTAN_config){
    write_command(INTAN_config, AMPLIFIER_FAST_SETTLE, 0x0000);
}



void convert_channel(INTAN_config_struct* INTAN_config, uint8_t Channel){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    volatile uint8_t saved_value;
    if (Channel >= 16){
        perror("Error: Too high Channel value.");
        while(1);
    }
    // No flags
    INTAN_config->array1[reg_config_num] = CONVERT_ACTION;
    
    // U flag
    if (INTAN_config->U_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_U; 
    } 
    
    // M flag
    if (INTAN_config->M_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_M; 
    } 
    
    // D flag 
    if (INTAN_config->D_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_D; 
    } 

    // H flag
    if (INTAN_config->H_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_H; 
    } 

    INTAN_config->array2[reg_config_num] = Channel;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;

    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = 'O';
    INTAN_config->expected_RX[reg_config_num] = ZEROS_32;


    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;


}

void convert_N_channels(INTAN_config_struct* INTAN_config){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    volatile uint8_t saved_value; 
    volatile uint8_t Channel;
    uint8_t i;
    INTAN_config->max_size = reg_config_num;
    uint8_t number_channels;
    number_channels = INTAN_config->number_channels_to_convert;
    
    // Convert the first channel and then convert the N following channels
    Channel = INTAN_config->initial_channel_to_convert;
    if (Channel >= 16){
        perror("Error: Too high Channel value.");
        while(1);
    }

    // No flags
    INTAN_config->array1[reg_config_num] = CONVERT_ACTION;
    
    // U flag
    if (INTAN_config->U_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_U; 
    } 
    
    // M flag
    if (INTAN_config->M_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_M; 
    } 
    
    // D flag 
    if (INTAN_config->D_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_D; 
    } 

    // H flag
    if (INTAN_config->H_flag == true){
        saved_value = INTAN_config->array1[reg_config_num];
        INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_H; 
    } 

    INTAN_config->array2[reg_config_num] = Channel;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;

    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = 'O';
    INTAN_config->expected_RX[reg_config_num] = ZEROS_32;


    reg_config_num += 1;

    for (i = number_channels; i>0; i--){
        // No flags
        INTAN_config->array1[reg_config_num] = CONVERT_ACTION;
        
