alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
        // U flag
        if (INTAN_config->U_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_U; 
        } 
        
        // M flag
        if (INTAN_config->M_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_M; 
        } 
        
        // D flag 
        if (INTAN_config->D_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_D; 
        } 

        // H flag
        if (INTAN_config->H_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_H; 
        } 

        INTAN_config->array2[reg_config_num] = CONVERT_ACTION_N;
        INTAN_config->array3[reg_config_num] = ZEROS_8;
        INTAN_config->array4[reg_config_num] = ZEROS_8;

        INTAN_config->expected_RX_bool[reg_config_num] = 0;
        INTAN_config->expected_RX[reg_config_num] = ZEROS_32;
        INTAN_config->instruction[reg_config_num] = 'O';
    


        reg_config_num += 1;
    }
    INTAN_config->max_size = reg_config_num;
}

// step selection as DAC configuration as a general thing for the register 35
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t sel1;         // 7 bits
    uint8_t sel2;         // 6 bits
    uint8_t sel3;         // 2 bits
} StepConfig;


static const StepConfig step_table[] = {
    // step_sel   sel1       sel2       sel3
    {  /*10nA*/ 10,      SEL1_10nA,         SEL2_10nA,         SEL3_10nA },  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*20nA*/ 20,      SEL1_20nA,         SEL2_20nA,         SEL3_20nA },  
    {  /*50nA*/ 50,      SEL1_50nA,         SEL2_50nA,         SEL3_50nA },
    {  /*100nA*/ 100,   SEL1_100nA,        SEL2_100nA,         SEL3_100nA },
    {  /*200nA*/ 200,   SEL1_200nA,        SEL2_200nA,         SEL3_200nA },
    {  /*500nA*/ 500,   SEL1_500nA,        SEL2_500nA,         SEL3_500nA },
    {  /*1uA*/ 1000,      SEL1_1uA,          SEL2_1uA,         SEL3_1uA },
    {  /*2uA*/ 2000,      SEL1_2uA,          SEL2_2uA,         SEL3_2uA },
    {  /*5uA*/ 5000,      SEL1_5uA,          SEL2_5uA,         SEL3_5uA },
    { /*10uA*/ 10000,    SEL1_10uA,         SEL2_10uA,         SEL3_10uA }
};


uint16_t step_sel_united(uint16_t step_sel) {
    unsigned int i;
    for (i = (sizeof(step_table) / sizeof(step_table[0])) - 1; i < sizeof(step_table) / sizeof(step_table[0]); --i) {
        if (step_table[i].current_nA == step_sel) {
            StepConfig cfg = step_table[i];
            uint16_t result = 0;
            result |= (cfg.sel3 & 0x03) << 13;
            result |= (cfg.sel2 & 0x3F) << 7;
            result |= (cfg.sel1 & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if step_sel is invalid
}


void stim_step_DAC_configuration(INTAN_config_struct* INTAN_config){
    // uint16_t step_DAC_selected;
    uint16_t step_DAC_selected = step_sel_united(INTAN_config->step_DAC);
    write_command(INTAN_config, STIM_STEP_SIZE, step_DAC_selected);

}

// step selection as DAC configuration as a general thing for the register 35
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t PBIAS;         // 7 bits
    uint8_t NBIAS;         // 6 bits
} BiasVoltageConfig;

static const BiasVoltageConfig bias_voltage_table[] = {
    // BiasVoltage   PBIAS       NBIAS       
    {  /*10nA*/ 10,      PBIAS_10nA,         NBIAS_10nA},  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*20nA*/ 20,      PBIAS_20nA,         NBIAS_20nA},  
    {  /*50nA*/ 50,      PBIAS_50nA,         NBIAS_50nA},
    {  /*100nA*/ 100,   PBIAS_100nA,        NBIAS_100nA},
    {  /*200nA*/ 200,   PBIAS_200nA,        NBIAS_200nA},
    {  /*500nA*/ 500,   PBIAS_500nA,        NBIAS_500nA},
    {  /*1uA*/ 1000,      PBIAS_1uA,          NBIAS_1uA},
    {  /*2uA*/ 2000,      PBIAS_2uA,          NBIAS_2uA},
    {  /*5uA*/ 5000,      PBIAS_5uA,          NBIAS_5uA},
    { /*10uA*/ 10000,    PBIAS_10uA,         NBIAS_10uA}
};

uint16_t vias_voltages_sel(uint16_t step_sel) {
    unsigned int i;
    for (i = (sizeof(bias_voltage_table) / sizeof(bias_voltage_table[0])) - 1; i < sizeof(bias_voltage_table) / sizeof(bias_voltage_table[0]); --i) {
        if (bias_voltage_table[i].current_nA == step_sel) {
            BiasVoltageConfig cfg = bias_voltage_table[i];
            uint16_t result = 0;
            result |= (cfg.PBIAS & 0x3F) << 8;
            result |= (cfg.NBIAS & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if step_sel is invalid
}


void stim_PNBIAS_configuration(INTAN_config_struct* INTAN_config){
    // uint16_t step_DAC_selected;
    uint16_t BIAS_selected = vias_voltages_sel(INTAN_config->step_DAC);
    write_command(INTAN_config, STIM_BIAS_VOLTAGE, BIAS_selected);

}

// Configuration of the current for each channel, channels start from 0 to 15
void stim_current_channel_configuration(INTAN_config_struct* INTAN_config, uint8_t channel, uint8_t neg_current_trim, uint8_t neg_current_mag, uint8_t pos_current_trim, uint8_t pos_current_mag){
    if (channel > 15){
        while(1){
            ON_INTAN_LED();
        }
    }
    uint8_t curr_reg_neg = channel + 64;
    uint8_t curr_reg_pos = channel + 96;
    uint16_t negative = unify_8bits(neg_current_trim, neg_current_mag);
    uint16_t positive = unify_8bits(pos_current_trim, pos_current_mag);
    write_command(INTAN_config, curr_reg_neg, negative);
    write_command(INTAN_config, curr_reg_pos, positive);
    if (!(INTAN_config->waiting_trigger)){
        INTAN_config->waiting_trigger = true;
    }
}



uint16_t unify_8bits(uint8_t high, uint8_t low) {
    return ((uint16_t)high << 8) | low;
}


uint32_t unify_16bits(uint16_t high, uint16_t low) {
    return ((uint32_t)high << 16) | low;
}

