alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
// Clean the compliance monitor register
void clean_compliance_monitor(INTAN_config_struct* INTAN_config){
    enable_M_flag(INTAN_config);
    read_command(INTAN_config, REGISTER_VALUE_TEST, 't');
    disable_M_flag(INTAN_config);    
}


// Check the compliance monitor to see if all the channels are in a correct charging position
void check_compliance_monitor(INTAN_config_struct* INTAN_config){
    read_command(INTAN_config, COMPLIANCE_MONITOR, 'M');
}

// Activate the charge recovery switch by connecting a channel to the stim_GND electrode witting in channel 46. 
// Channels are connected one by one.
void connect_channel_to_gnd(INTAN_config_struct* INTAN_config, uint8_t channel){
    if (channel > 15){
        ON_INTAN_LED();
          perror("Trying to connect a too high channel to gnd.");
        while(1);
    }
    write_command(INTAN_config, CHRG_RECOV_SWITCH, channel+1);
    INTAN_config->waiting_trigger = true;
}


// Recovery current limited to get to the Vrecov
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t sel1;         // 7 bits
    uint8_t sel2;         // 6 bits
    uint8_t sel3;         // 2 bits
} chrg_recov_curr_lim_config;

static const chrg_recov_curr_lim_config chrg_recov_curr_lim_table[] = {
    // step_sel   sel1       sel2       sel3
    {  /*1nA*/ 1,        CL_SEL1_1nA,         CL_SEL2_1nA,         CL_SEL3_1nA },  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*2nA*/ 2,        CL_SEL1_2nA,         CL_SEL2_2nA,         CL_SEL3_2nA },  
    {  /*5nA*/ 5,        CL_SEL1_5nA,         CL_SEL2_5nA,         CL_SEL3_5nA },
    {  /*10nA*/ 10,     CL_SEL1_10nA,        CL_SEL2_10nA,         CL_SEL3_10nA },
    {  /*20nA*/ 20,     CL_SEL1_20nA,        CL_SEL2_20nA,         CL_SEL3_20nA },
    {  /*50nA*/ 50,     CL_SEL1_50nA,        CL_SEL2_50nA,         CL_SEL3_50nA },
    {  /*100nA*/ 100,  CL_SEL1_100nA,       CL_SEL2_100nA,         CL_SEL3_100nA },
    {  /*200nA*/ 200,  CL_SEL1_200nA,       CL_SEL2_200nA,         CL_SEL3_200nA },
    {  /*500nA*/ 500,  CL_SEL1_500nA,       CL_SEL2_500nA,         CL_SEL3_500nA },
    {  /*1000nA*/ 1000,  CL_SEL1_1uA,         CL_SEL2_1uA,         CL_SEL3_1uA }
};

uint16_t chrg_recov_curr_lim_united(uint16_t curr_lim_sel) {
    unsigned int i;
    for (i = (sizeof(chrg_recov_curr_lim_table) / sizeof(chrg_recov_curr_lim_table[0])) - 1; i < sizeof(chrg_recov_curr_lim_table) / sizeof(chrg_recov_curr_lim_table[0]); --i) {
        if (chrg_recov_curr_lim_table[i].current_nA == curr_lim_sel) {
            chrg_recov_curr_lim_config cfg = chrg_recov_curr_lim_table[i];
            uint16_t result = 0;
            result |= (cfg.sel3 & 0x03) << 13;
            result |= (cfg.sel2 & 0x3F) << 7;
            result |= (cfg.sel1 & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if curr_lim_sel is invalid
}

void charge_recovery_current_configuration(INTAN_config_struct* INTAN_config){
    uint16_t current_lim_sel = chrg_recov_curr_lim_united(INTAN_config->current_recovery);
    write_command(INTAN_config, CHARGE_RECOVERY_CURRENT_LIMIT, current_lim_sel);
}


// Voltage at witch the electrodes will be driven with a concrete current value
void charge_recovery_voltage_configuration(INTAN_config_struct* INTAN_config){
    double voltage = INTAN_config->voltage_recovery;
    // Force the value of the voltage to be between +1.225 and -1.215

    if (voltage < -1.225) voltage = -1.225;
    if (voltage >  1.215) voltage =  1.215;

    // Transformación: valor_reg = 128 + (V / 0.00957)
    int value = (int)round(128.0 + (voltage / 0.00957));

    // Make sure is beatween 0 and 255
    if (value < 0)   value = 0;
    if (value > 255) value = 255;

    write_command(INTAN_config, CURRENT_LIMITED_CHARGE_RECOVERY_VOLTAGE_TARGET, value);

}


// ADC Buffer Bias Current related registers
void ADC_sampling_rate_config(INTAN_config_struct* INTAN_config){
    uint16_t sampling_rate = INTAN_config->ADC_sampling_rate;
    uint8_t ADC_buffer_bias;
    uint8_t MUX_bias;
        if (sampling_rate <= 120){
            ADC_buffer_bias = ADC_BUFFER_BIAS_less_120k;
            MUX_bias = MUX_BIAS_less_120k;
        } else if (sampling_rate > 120 & sampling_rate <= 140) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_140k;
            MUX_bias = MUX_BIAS_140k;
        } else if (sampling_rate > 140 & sampling_rate <= 175) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_175k;
            MUX_bias = MUX_BIAS_175k;        
        } else if (sampling_rate > 175 & sampling_rate <= 220) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_220k;
            MUX_bias = MUX_BIAS_220k;        
        } else if (sampling_rate > 220 & sampling_rate <= 280) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_280k;
            MUX_bias = MUX_BIAS_280k;        
        } else if (sampling_rate > 280 & sampling_rate <= 350) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_350k;
            MUX_bias = MUX_BIAS_350k;        
        } else if (sampling_rate > 350 & sampling_rate <= 440) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_440k;
            MUX_bias = MUX_BIAS_440k;        
        } else {
            ADC_buffer_bias = ADC_BUFFER_BIAS_more_440k;
            MUX_bias = MUX_BIAS_more_440k;                
        }

    uint16_t bias_value = ((uint16_t)ADC_buffer_bias << 6) | MUX_bias;

    write_command(INTAN_config, ADC_BIAS_BUFFER, bias_value);
    
    
}


// Impedance check control register 2 configuration
void impedance_check_control(INTAN_config_struct* INTAN_config){
    uint8_t zcheck_select = INTAN_config->zcheck_select;
    bool zcheck_DAC_enhable = INTAN_config->zcheck_DAC_enhable;
    bool zcheck_load = INTAN_config->zcheck_load;
    uint8_t zcheck_scale = INTAN_config->zcheck_scale;
    bool zcheck_en = INTAN_config->zcheck_en;
    
    if (zcheck_select > 15){
        ON_INTAN_LED();
        while(1);
    }
    
    uint16_t reg_value = ((uint16_t)zcheck_select << 8) | ((uint16_t)zcheck_DAC_enhable << 6) | ((uint16_t)zcheck_load << 5) | ((uint16_t)zcheck_scale << 3) | zcheck_en;
    write_command(INTAN_config, IMPEDANCE_CHECK_CONTROL, reg_value);
}

// Impedance check DAC value
void impedance_check_DAC(INTAN_config_struct* INTAN_config){
    write_command(INTAN_config, IMPEDANCE_CHECK_DAC, INTAN_config->zcheck_DAC_value);

