alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
}



// Fault current detection
void fault_current_detection(INTAN_config_struct* INTAN_config){
    read_command(INTAN_config, FAULT_CURR_DET, 'f');
}


// Enabling and controlling the digital external outputs 
void enable_digital_output_1(INTAN_config_struct* INTAN_config){
    INTAN_config->digout1HZ = 0;
    write_register_1(INTAN_config);
}
void enable_digital_output_2(INTAN_config_struct* INTAN_config){
    INTAN_config->digout2HZ = 0;
    write_register_1(INTAN_config);
}

// Disabling digital output 1 and 2
void disable_digital_output_1(INTAN_config_struct* INTAN_config){
    INTAN_config->digout1HZ = 1;
    write_register_1(INTAN_config);
}
void disable_digital_output_2(INTAN_config_struct* INTAN_config){
    INTAN_config->digout2HZ = 1;
    write_register_1(INTAN_config);
}

// ON output 1 or 2
void power_ON_output_1(INTAN_config_struct* INTAN_config){
    INTAN_config->digout1 = 1;
    write_register_1(INTAN_config);
}
void power_ON_output_2(INTAN_config_struct* INTAN_config){
    INTAN_config->digout2 = 1;
    write_register_1(INTAN_config);
}

// OFF output 1 or 2
void power_OFF_output_1(INTAN_config_struct* INTAN_config){
    INTAN_config->digout1 = 0;
    write_register_1(INTAN_config);
}
void power_OFF_output_2(INTAN_config_struct* INTAN_config){
    INTAN_config->digout2 = 0;
    write_register_1(INTAN_config);
}

// Compliment 2 enable and disable 
void enable_C2(INTAN_config_struct* INTAN_config){
    INTAN_config->C2_enabled = true;
    write_register_1(INTAN_config);
}
void disable_C2(INTAN_config_struct* INTAN_config){
    INTAN_config->C2_enabled = false;    
    write_register_1(INTAN_config);
}

// Enabling and disabling absolute value configuration
void enable_absolute_value(INTAN_config_struct* INTAN_config){
    INTAN_config->abs_mode = true;    
    write_register_1(INTAN_config);
}

void disable_absolute_value(INTAN_config_struct* INTAN_config){
    INTAN_config->abs_mode = false;    
    write_register_1(INTAN_config);
}

// Enable or disable the digital signal processing HPF
void disable_digital_signal_processing_HPF(INTAN_config_struct* INTAN_config){
    INTAN_config->DSPen = true;
    write_register_1(INTAN_config);
}
void enable_digital_signal_processing_HPF(INTAN_config_struct* INTAN_config){
    INTAN_config->DSPen = false;
    write_register_1(INTAN_config);
}

// Digital signal processing filter HPF cutoff frequency configuration
void DSP_cutoff_frequency_configuration(INTAN_config_struct* INTAN_config){
    float_t f_sampling;
    f_sampling = INTAN_config->ADC_sampling_rate/INTAN_config->number_channels_to_convert; 
    float_t K;
    K = INTAN_config->DSP_cutoff_freq/f_sampling;
    if (K>=0.1103){
        INTAN_config->DSP_cutoff_freq_register = 1;

    }else if (K >= 0.04579 & K < 0.1103) {
        INTAN_config->DSP_cutoff_freq_register = 2;    
    
    }else if (K >= 0.02125 & K < 0.04579) {
        INTAN_config->DSP_cutoff_freq_register = 3;    
    
    }else if (K >= 0.01027 & K < 0.02125) {
        INTAN_config->DSP_cutoff_freq_register = 4;  
         
    }else if (K >= 0.005053 & K < 0.01027) {
        INTAN_config->DSP_cutoff_freq_register = 5;    
    
    }else if (K >= 0.002506 & K < 0.005053) {
        INTAN_config->DSP_cutoff_freq_register = 6;    
    
    }else if (K >= 0.001248 & K < 0.002506) {
        INTAN_config->DSP_cutoff_freq_register = 7;    
    
    }else if (K >= 0.0006229 & K < 0.001248) {
        INTAN_config->DSP_cutoff_freq_register = 8;    
    }else if (K >= 0.0003112 & K < 0.0006229) {
        INTAN_config->DSP_cutoff_freq_register = 9;    
    }else if (K >= 0.0001555 & K < 0.0003112) {
        INTAN_config->DSP_cutoff_freq_register = 10;    
    }else if (K >= 0.00007773 & K < 0.0001555) {
        INTAN_config->DSP_cutoff_freq_register = 11;    
    }else if (K >= 0.00003886 & K < 0.00007773) {
        INTAN_config->DSP_cutoff_freq_register = 12;    
    }else if (K >= 0.00001943 & K < 0.00003886) {
        INTAN_config->DSP_cutoff_freq_register = 13;    
    }else if (K >= 0.000009714 & K < 0.00001943) {
        INTAN_config->DSP_cutoff_freq_register = 14;    
    }else if (K >= 0.000004857 & K < 0.000009714) {
        INTAN_config->DSP_cutoff_freq_register = 15;    
    }else if (K < 0.000004857) {
        INTAN_config->DSP_cutoff_freq_register = 15;
    }
    write_register_1(INTAN_config);
}


// Write in register 1 the cutoff frequency of the digital signal processing HPF

void write_register_1(INTAN_config_struct* INTAN_config){
    uint16_t DATA = 
    ((uint16_t)INTAN_config->digoutOD   << 12) |
    ((uint16_t)INTAN_config->digout2    << 11) |
    ((uint16_t)INTAN_config->digout2HZ  << 10) |
    ((uint16_t)INTAN_config->digout1    << 9)  |
    ((uint16_t)INTAN_config->digout1HZ  << 8)  |
    ((uint16_t)INTAN_config->weak_MISO  << 7)  |
    ((uint16_t)INTAN_config->C2_enabled << 6)  |
    ((uint16_t)INTAN_config->abs_mode   << 5)  |
    ((uint16_t)INTAN_config->DSPen      << 4)  |
    ((uint16_t)INTAN_config->DSP_cutoff_freq_register);
    write_command(INTAN_config, REGISTER_1, DATA);
}

// Minimum power disipation writting FFFF in register 38: error in hardware produces that this register must be all ones.

void minimum_power_disipation(INTAN_config_struct* INTAN_config){

    write_command(INTAN_config, DC_AMPLIFIER_POWER, 0xFFFF);
    
    write_command(INTAN_config, CH0_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH1_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH2_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH3_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH4_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH5_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH6_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH7_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH8_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH9_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH10_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH11_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH12_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH13_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH14_NEG_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH15_NEG_CURR_MAG, 0x0000);
    
    write_command(INTAN_config, CH0_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH1_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH2_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH3_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH4_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH5_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH6_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH7_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH8_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH9_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH10_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH11_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH12_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH13_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH14_POS_CURR_MAG, 0x0000);
    write_command(INTAN_config, CH15_POS_CURR_MAG, 0x0000);

    // Charge recovery current limitto 1 nA
    INTAN_config->current_recovery = 1;
    charge_recovery_current_configuration(INTAN_config);

    // stimulation current step
    INTAN_config->step_DAC = 10;
    stim_step_DAC_configuration(INTAN_config);


    // Second AC amplifier lower cutoff frequency
    INTAN_config->fc_low_B = 0.1f;
    fc_low_B(INTAN_config);

    // Power down un used AC amplifiers
    write_command(INTAN_config, ADC_INDIVIDUAL_AMP_POWER, 0x0000);

    






}



void wait_5_CYCLES(){
    __delay_cycles(CLK_5_CYCLES);
}

void wait_30_seconds(){
    __delay_cycles(CLK_30_S_CYCLES);
}

void wait_5_mins(){
    __delay_cycles(CLK_5_M_CYCLES);
}

void wait_1_second(){
    __delay_cycles(CLK_1_S_CYCLES);
}

void wait_3_seconds(){
    __delay_cycles(CLK_3_S_CYCLES);
}

void wait_5_seconds(){
    __delay_cycles(CLK_5_S_CYCLES);
}


